sCOP/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-04-27 土 17:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>sCOP: a SAT-based CP System</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Takehide Soh" />
<!-- Global site tag (gtag.js) - Google Analytics -->
<link rel="stylesheet" type="text/css" href="../myhome.css" />
</head>
<body>
<div id="content">
<h1 class="title">sCOP: a SAT-based CP System</h1>

<div id="outline-container-org1017168" class="outline-2">
<h2 id="org1017168">Overview of sCOP</h2>
<div class="outline-text-2" id="text-org1017168">
<ul class="org-ul">
<li>sCOP is a Sat-based COnstraint Programming system written in Scala
2.12.</li>
<li>sCOP aims to be a re-implementation of <a href="http://bach.istc.kobe-u.ac.jp/sugar/">Sugar</a> (Tamura et al.) 
written in Java. Many things are imported from <a href="http://bach.istc.kobe-u.ac.jp/sugar/">Sugar</a> (software 
design, normalization, and encoding). Currently, main differences
are as follows: 
<ul class="org-ul">
<li><a href="http://xcsp.org">XCSP3</a> instances is accepted as input in sCOP.</li>
<li>Encoding of extensional constraints is different between the two systems.</li>
<li>Some of encoding heuristics is different between the two systems.</li>
<li>Log encoding (from CSP into SAT) is implemented by using the BDD
encoding (<a href="https://satassociation.org/jsat/index.php/jsat/article/view/18">Een and Sorensson</a>).</li>
</ul></li>
<li>It works as follows:
<ol class="org-ol">
<li>encode a XCSP3 file into a DIMACS CNF file.</li>
<li>launch a SAT solver to solve the encoded CNF file.</li>
<li>the output of the SAT solver is decoded to the solution of the
XCSP3 instance.</li>
</ol></li>
</ul>
</div>
</div>

<div id="outline-container-org3cb75ce" class="outline-2">
<h2 id="org3cb75ce">Reference</h2>
<div class="outline-text-2" id="text-org3cb75ce">
<ul class="org-ul">
<li>sCOP: SAT-based Constraint Programming System. Takehide Soh,
Daniel Le Berre, Mutsunori Banbara, Naoyuki Tamura. 
In Proceedings of XCSP3 Competition 2018, 93&#x2013;94, 2018. <a href="http://www.cril.univ-artois.fr/XCSP18/files/XCSP3_2018_Proceedings.pdf">http://www.cril.univ-artois.fr/XCSP18/files/XCSP3_2018_Proceedings.pdf</a></li>
</ul>
</div>
</div>

<div id="outline-container-org39dff1a" class="outline-2">
<h2 id="org39dff1a">Download</h2>
<div class="outline-text-2" id="text-org39dff1a">
<ul class="org-ul">
<li><a href="scop-for-xcsp18-180731.tar.gz">the version submitted to XCSP18</a></li>
</ul>
</div>
</div>

<div id="outline-container-org24b297b" class="outline-2">
<h2 id="org24b297b">Components of sCOP</h2>
<div class="outline-text-2" id="text-org24b297b">
<ul class="org-ul">
<li>scop.jar
<ul class="org-ul">
<li>It is a fat jar containing all resources except SAT solvers
<ul class="org-ul">
<li>XCSP3-Java-Tools (<a href="https://github.com/xcsp3team/XCSP3-Java-Tools">https://github.com/xcsp3team/XCSP3-Java-Tools</a>)</li>
<li>scop</li>
<li>scala standard libraries (version 2.12)</li>
</ul></li>
</ul></li>

<li>scop.sh
<ul class="org-ul">
<li>It is a wrapper for XCSP18.</li>
</ul></li>

<li>MapleCOMSPS
<ul class="org-ul">
<li>It is an award-winning SAT solver downloaded from the following
URL.</li>
<li>Note that there are several versions of MapleCOMSPS in the
official web page. The one we used is only available in the
exactly the same URL as follows.</li>
<li>Note again, we used &ldquo;simp&rdquo; not &ldquo;core&rdquo;.</li>
<li><a href="https://sites.google.com/a/gsd.uwaterloo.ca/maplesat/MapleCOMSPS.zip">https://sites.google.com/a/gsd.uwaterloo.ca/maplesat/MapleCOMSPS.zip</a></li>
</ul></li>

<li>glucose-syrup
<ul class="org-ul">
<li>It is an award-winning SAT solver downloaded from the following
URL.</li>
<li>Note that we used the version submitted to the SAT competition 2017.</li>
<li><a href="https://baldur.iti.kit.edu/sat-competition-2017/solvers/parallel/syrup.zip">https://baldur.iti.kit.edu/sat-competition-2017/solvers/parallel/syrup.zip</a></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgb581395" class="outline-2">
<h2 id="orgb581395">Requirements for sCOP</h2>
<div class="outline-text-2" id="text-orgb581395">
<ul class="org-ul">
<li>Java 8</li>
<li>(Note) Scala 2.12 is not necessary since scop.jar is a fat jar
containing scala standard libraries.</li>
</ul>
</div>
</div>

<div id="outline-container-org364ba6b" class="outline-2">
<h2 id="org364ba6b">Notations in the following</h2>
<div class="outline-text-2" id="text-org364ba6b">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">DIR</td>
<td class="org-left">It stands for the directory where you place scop-for-xcsp18</td>
</tr>

<tr>
<td class="org-left">TMPDIR</td>
<td class="org-left">It is the directory where the solver is allowed to</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">create temporary files</td>
</tr>

<tr>
<td class="org-left">BENCHNAME</td>
<td class="org-left">It stands for the name of the instance file (with its extension)</td>
</tr>

<tr>
<td class="org-left">NBCORE</td>
<td class="org-left">It stands for the number of processing units allocated to the solver</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org6290575" class="outline-2">
<h2 id="org6290575">How to install</h2>
<div class="outline-text-2" id="text-org6290575">
<ul class="org-ul">
<li>We need to compile 2 SAT solvers respectively for sequential
solving and parallel solving.</li>
</ul>
</div>

<div id="outline-container-org669f06e" class="outline-3">
<h3 id="org669f06e">(Sequential CSP) MapleCOMSPS</h3>
<div class="outline-text-3" id="text-org669f06e">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #483d8b;">cd</span> DIR/MapleCOMSPS
<span style="color: #483d8b;">export</span> <span style="color: #a0522d;">MROOT</span>=<span style="color: #ff00ff;">`pwd`</span>
<span style="color: #483d8b;">cd</span> simp
make clean
make r
</pre>
</div>
</div>
</div>

<div id="outline-container-org36375e9" class="outline-3">
<h3 id="org36375e9">(Parallel CSP) glucose-syrup</h3>
<div class="outline-text-3" id="text-org36375e9">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #483d8b;">cd</span> DIR/syrup
make clean
make
</pre>
</div>
</div>
</div>

<div id="outline-container-org2ed266c" class="outline-3">
<h3 id="org2ed266c">lzma (os command)</h3>
<div class="outline-text-3" id="text-org2ed266c">
<ul class="org-ul">
<li>we assume an os command &rsquo;lzma&rsquo; is available for decomposing *.xml.lzma instances.</li>
<li>If there is not &rsquo;lzma&rsquo; then simply give *.xml to scop.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org72b8a20" class="outline-2">
<h2 id="org72b8a20">How to run</h2>
<div class="outline-text-2" id="text-org72b8a20">
<ul class="org-ul">
<li>(NOTE) we here assume 11GB/22GB can be allocated to JVM. This is
XCSP18 competition setting but larger heap size is better in
principal.</li>
<li>assume that the following command is executed in the &rsquo;scop-for-xcsp18&rsquo; directory.</li>
<li><p>
<b>(Sequential CSP) with -both option</b>
</p>
<div class="org-src-container">
<pre class="src src-sh">DIR/scop.sh 11g DIR/scop.jar -both DIR/MapleCOMSPS/simp/minisat_release default TMPDIR BENCHNAME
</pre>
</div></li>
<li><p>
<b>(Sequential CSP) with -order option</b>
</p>
<div class="org-src-container">
<pre class="src src-sh">DIR/scop.sh 11g DIR/scop.jar -order DIR/MapleCOMSPS/simp/minisat_release default TMPDIR BENCHNAME
</pre>
</div></li>
<li><p>
<b>(Parallel CSP) with -both option</b>
</p>
<div class="org-src-container">
<pre class="src src-sh">DIR/scop.sh 22g DIR/scop.jar -both DIR/syrup/bin/glucose-syrup -model:-nthreads=NBCORE:-maxmemory=20000 TMPDIR BENCHNAME
</pre>
</div></li>
<li><p>
<b>(Parallel CSP) with -order option</b>
</p>
<div class="org-src-container">
<pre class="src src-sh">DIR/scop.sh 22g DIR/scop.jar -order DIR/syrup/bin/glucose-syrup -model:-nthreads=NBCORE:-maxmemory=20000 TMPDIR BENCHNAME
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org878d25d" class="outline-2">
<h2 id="org878d25d">Example (please refer <a href="http://xcsp.org/series">http://xcsp.org/series</a> for example XCSP3 instances)</h2>
<div class="outline-text-2" id="text-org878d25d">
<ul class="org-ul">
<li>(NOTE) we here assume 11GB/24GB can be allocated to JVM. This is
XCSP18 competition setting but if possible larger size is
preferred.</li>
<li>assume that the following command is executed in the &rsquo;scop-for-xcsp18&rsquo; directory.</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">./scop.sh 16g scop.jar -both MapleCOMSPS/simp/minisat_release default /tmp examples/AllInterval-007.xml
</pre>
</div>
</div>
</div>

<div id="outline-container-org195f20a" class="outline-2">
<h2 id="org195f20a">License</h2>
<div class="outline-text-2" id="text-org195f20a">
<ul class="org-ul">
<li>see <a href="LICENSE.txt">LICENSE.txt</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgca6c3ad" class="outline-2">
<h2 id="orgca6c3ad">Contact</h2>
<div class="outline-text-2" id="text-orgca6c3ad">
<ul class="org-ul">
<li>please e-mail to <a href="http://kix.istc.kobe-u.ac.jp/~soh/">Takehide Soh</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5d578ae" class="outline-2">
<h2 id="org5d578ae">Links for Related Tool</h2>
<div class="outline-text-2" id="text-org5d578ae">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="http://kix.istc.kobe-u.ac.jp/~soh/scarab/">Scarab</a></td>
<td class="org-left">a very light weight SAT-based CP System</td>
</tr>

<tr>
<td class="org-left"><a href="http://kix.istc.kobe-u.ac.jp/~soh/dsugar/">Diet-Sugar</a></td>
<td class="org-left">A SAT-based CSP Solver Equipped with Hybrid Encoding integrating Order and Log Encodings</td>
</tr>

<tr>
<td class="org-left"><a href="http://www.sat4j.org">Sat4j</a></td>
<td class="org-left">SAT solver in Java, which Scarab adopts!</td>
</tr>

<tr>
<td class="org-left"><a href="http://bach.istc.kobe-u.ac.jp/sugar/">Sugar</a></td>
<td class="org-left">SAT-based CSP Solver using order encoding.</td>
</tr>

<tr>
<td class="org-left"><a href="http://bach.istc.kobe-u.ac.jp/copris/">Copris</a></td>
<td class="org-left">Copris is a constraint programming DSL embedded in Scala.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">It is also developed by our team!</td>
</tr>

<tr>
<td class="org-left"><a href="https://github.com/crillab/nacre_mini">NACRE</a></td>
<td class="org-left">NACRE (Nogood And Clause Reasoning Engine) is a constraint solver written in C++.</td>
</tr>

<tr>
<td class="org-left"><a href="https://github.com/eomahony/Numberjack">Numberjack</a></td>
<td class="org-left">Constraint Programming System in Python</td>
</tr>

<tr>
<td class="org-left"><a href="http://code.google.com/p/scalasmt/">scalasmt</a></td>
<td class="org-left">SMT in Scala using Z3</td>
</tr>

<tr>
<td class="org-left"><a href="https://bitbucket.org/oscarlib/oscar">OscaR</a></td>
<td class="org-left">OR in Scala</td>
</tr>

<tr>
<td class="org-left"><a href="http://jacop.osolpro.com/">JaCoP</a></td>
<td class="org-left">Constraint programming in Java and Scala</td>
</tr>

<tr>
<td class="org-left"><a href="http://www.emn.fr/x-info/choco-solver/">Choco</a></td>
<td class="org-left">Constraint programming in Java</td>
</tr>

<tr>
<td class="org-left"><a href="http://jcp.org/en/jsr/detail?id=331">JSR 331</a></td>
<td class="org-left">Java Specification Requests: Constraint Programming API</td>
</tr>

<tr>
<td class="org-left"><a href="http://amit.metodi.me/research/bee/">BEE</a></td>
<td class="org-left">a compiler which enables to encode finite domain constraint problems to CNF.</td>
</tr>

<tr>
<td class="org-left"><a href="http://jason.matf.bg.ac.rs/~mirkos/Mesat.html">meSAT</a></td>
<td class="org-left">Multiple Encodings of CSP to SAT</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Takehide Soh</p>
<p class="date">Created: 2019-04-27 土 17:05</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
